module.exports = {
  async up(queryInterface, Sequelize) {
    await queryInterface.bulkInsert('Territories', [
      {
        p00: '0100000000', p01: 'Алтайский край', utv: '0', p02: 'Алтайского края', sp: '0',
      },
      {
        p00: '0300000000', p01: 'Краснодарский край', utv: '0', p02: 'Краснодарского края', sp: '0',
      },
      {
        p00: '0400000000', p01: 'Красноярский край', utv: '0', p02: 'Красноярского края', sp: '0',
      },
      {
        p00: '0500000000', p01: 'Приморский край', utv: '0', p02: 'Приморского края', sp: '0',
      },
      {
        p00: '0700000000', p01: 'Ставропольский край', utv: '0', p02: 'Ставропольский край', sp: '0',
      },
      {
        p00: '0800000000', p01: 'Хабаровский край', utv: '0', p02: 'Хабаровского края', sp: '0',
      },
      {
        p00: '1000000000', p01: 'Амурская область', utv: '0', p02: 'Амурской области', sp: '0',
      },
    ], {});
  },

  async down(queryInterface, Sequelize) {
    await queryInterface.bulkDelete('Territories', null, {});
  },
};
